SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #GWR4061
 Type ( Engine )
 WagonShape ( GWR4061.s )
 
 Size ( 2.74068m 4.06079m 12.33188m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0m 2.03383m -0.233203m )
 Mass ( 76t)
 InertiaTensor ( Box (2.74068m 4.06079m 12.33188m) )
 Coupling (
  Type ( Bar )
  Spring (  comment ( AndiWide19 ) 
   Stiffness ( 0N/m 2e6N/m )
   Damping ( 1e3N/m/s 2.3e6N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.08m )
  )
  CouplingUniqueType ( rh4000brt )
  CouplingHasRigidConnection ( 1 )
  Velocity ( 0.1m/s )
 )
 Coupling (
  Type ( Chain )
  Spring (  comment ( AndiWide19 ) 
   Stiffness ( 0N/m 2e6N/m )
   Damping ( 1e3N/m/s 2.3e6N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.08m )
  )
  Velocity ( -0.1m/s )
 )
 Buffers (
  Spring (  comment ( stiff2 ) 
   Stiffness ( 1e6N/m 1e7N/m )
   Damping ( 0N/m/s 0N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.05m )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 1deg )
 ) 
 

 Adheasion ( 0.070 0.140 2.0 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 304kN )
 DerailBufferForce ( 500kN )
 WheelRadius ( 6.421m )
 NumWheels ( 1 )
 Friction (
  1002N/m/s 0 0.001m/s 7.61N/m/s 1.98
  0N/rad/s 0 0.001rad/s 29076N/rad/s 0.88
 )
 BrakeEquipmentType ( "Vacuum_brake, Triple_valve" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce ( 76kN )
 MaxHandbrakeForce ( 114kN )
 NumberOfHandbrakeLeverSteps ( 100 )
 MaxReleaseRate ( 1 )
 MaxApplicationRate ( 1 )
 MaxAuxilaryChargingRate( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )        
 
 Sound ( "../../scotsman/Sound/fscoteng.sms" )

 Lights ( 4
  Light (
   Type ( 1 #Sphere of light )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 33333333 )
     Position ( 0 1.5 6 )
     Transition ( 0 )
     Radius ( 200.0 )
     Angle ( 75.0 )
     )
    )
   )

  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( 0 2.0 -4.8 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( 0 2.0 -4.8 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    )
   )

  Light (
   comment( Flickering front oil lamp TOP dim )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ffff70 )
     Position ( -0.82 1.39 5.325 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( -0.82 1.39 5.325 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
     Elevation ( -10 -10 -10 )
     )
    )
   )
  Light (
   comment( Flickering front oil lamp TOP dim )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ffff70 )
     Position ( 0.89 1.39 5.325 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( 0.89 1.39 5.325 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.4 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

  )
 )

Engine ( #GWR4061
 Effects
 (
  SteamSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   WhistleFX
   (
    0 4.2 -4.55
    0 1 0
    0.05
   )

   SafetyValvesFX
   (
    0 4.2 -0.9
    0 0.7 0
    0.2
   )

   StackFX
   (
    0 4.25 3.15
    0 1.1 0
                  0.175
 
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )

   CylindersFX
   (
    -0.8 0.51 2.5
    0 -0.3 1.75
    0.1
   )

   CylindersFX
   (
    0.8 0.51 2.5
    0 -0.3 1.75
    0.1
   )
  )
 )

 Wagon ( #GWR4061 )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 EngineBrakesControllerMinSystemPressure ( 0 )
 EngineBrakesControllerMaxSystemPressure ( 21 )
 EngineBrakesControllerDirectControlExponent ( 1.5 )
 TrainBrakesControllerEmergencyApplicationRate ( 1 )
 TrainBrakeControllerMinContinuousService ( 0 )
 Injector1WaterValveVarience ( 0.1 )
 Injector2WaterValveVarience ( 0.1 )
 CutoffMaxReverse ( -0.75 )
 CutoffMaxForward ( 0.75 )
 CutoffSmallestSetting ( 10 )
 MaxPower ( 1047kW )
 MaxForce ( 27797lbf )
 MaxVelocity ( 95mph )
 WheelRadius ( 6.421m )
 Sanding ( 1e9mph )
 NumWheels ( 2 )
 BoilerLength ( 7.25m )
 BoilerVolume ( "377.49*(ft^3)" )
 BoilerEffectivity ( 1 )
 DraftingEffect ( 0.95 )
 BoilerResponsiveness ( 1.05 )
 CoalBurnage ( 2.5 )
 MaxBoilerOutput ( 28666lb/h )
 NumCylinders ( 4 )
 CylinderStroke ( 26in )
 CylinderDiameter ( 15in )
 CylinderVolume ( "21.28*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 25mm 25mm )
 ExhaustLimit ( 31532lb/h )
 PrimingFactor ( .95 )
 SteamMinPrimingLevel ( 1.1 )
 BlastExponent ( 0.6 )
 MaxBoilerPressure ( 225psi )
 MaxFireMass ( 1928lb )
 IdealFireMass ( 1408lb )
 MaxWaterMass ( 3854lb )  
 SafetyValvesSteamUsage ( 30000 )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 14560lb )
 MaxTenderWaterMass ( 40000lb )

 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes ( 0 1 ) 
 Injector1FeedrateMultiplierExhaust ( 1 )
      Injector1FeedrateMultiplierLive ( 1 )
      Injector2FeedrateMultiplierExhaust ( 1 )
      Injector2FeedrateMultiplierLive ( 1 )
      Injector1WaterValveVariance ( 0.25 )
      Injector2WaterValveVariance ( 0.25 )
 SuperHeater ( 1.14 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 1 )
 MaxSteamHeatingPressure( 20 )
 SafetyValvePressureDifference ( 22 )
 SteamGaugeGlassHeight( 10 )
 SteamFiremanMaxPossibleFiringRate( 30000 )

 BasicSteamUsage ( 1433lb/h )
 BasicCoalUsage ( 204lb/h )

 comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

      VacuumBrakesSmallEjectorPowerRating ( 5.7 )
 VacuumBrakesMinBoilerPressureMaxVacuum ( 112 )
 VacuumBrakesSmallEjectorUsageRate ( 573 )
 VacuumBrakesLargeEjectorUsageRate ( 1719 )
 VacuumBrakesHasVacuumPump ( 0 )

 TrainBrakesControllerMaxApplicationRate ( 1 )
 TrainBrakesControllerMaxReleaseRate ( 1 )
 TrainBrakesControllerMinSystemPressure ( 0 )
 TrainBrakesControllerMaxSystemPressure ( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
      EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
      BrakesEngineControllers ( "Independent,Train" )

 SteamSmallestCutoff( 0.8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType ( Single_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent ( 1 )
 RegulatorSecondValveExponent( 1.75 )
 RegulatorPilotValveFullOpenning ( 1 )
 RegulatorMainValveInitialOpenning( 0.49 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamWaterScoopMinPickupSpeed( 25 ) comment( mph )
 SteamWaterScoopMaxPickupSpeed( 60 ) comment( mph )
 SteamWaterScoopResistance( 8500N )
 comment( pounds per second. 6000gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 1000 )
        EngineControllers (
            comment( standardised engine controls )
        
            Regulator ( 0 1 0.02 0 
                NumNotches( 0 )
            )
            Cutoff    ( -0.75 0.75 0.05 0 
                NumNotches( 0 )
            )
            Brake_Train ( 0 1 0.1 0.4 
                NumNotches( 4
                    Notch ( 0     1 TrainBrakesControllerReleaseStart )
                    Notch ( 0.4   0 TrainBrakesControllerHoldStart )
                    Notch ( 0.42  1 TrainBrakesControllerApplyStart )
                    Notch ( 1     1 TrainBrakesControllerEmergencyStart ) 
                )
            )
            Brake_Engine ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Shovel ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 0 )
            Whistle ( 0 1 0 )
            BellToggle ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 0 )
            Headlights( 0 1 0 )
        )


 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables ( 800 1126 2965 214 1.0 40000 1.0 0.8 1 1)
 comment(fire temp:       min. 300, max. 1000
         fire mass:       ideal 1408, max. 1928
         water mass:      max. 3854
         boiler pressure: max. 225 )

     Name ( "BR HW - # GWR Star Class 4061" )
  Description (
  "A Star Class Locomotive from the Great Western Railway"

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
